m5stack/uiflow-micropython/m5stack/boards/M5STACK_ToughC5/mpconfigboard.h
/*
 * SPDX-FileCopyrightText: 2026 M5Stack Technology CO LTD
 *
 * SPDX-License-Identifier: MIT
 */

#define MICROPY_HW_BOARD_NAME "M5Stack ToughC5"
#define MICROPY_HW_MCU_NAME "ESP32C5"

#define MICROPY_HW_I2C0_SCL (3)
#define MICROPY_HW_I2C0_SDA (2)

#include "./../mpconfiglvgl.h"
